using System;

namespace Лабораторная_работа__1
{
    Класс   Lab5 внутренний : iLabs
    {
        /// <краткое изложение>
        /// Метод демонстрации всех заданий лабораторной работы
        /// </резюме> 
        Демонстрационная  пустая  публичная()
        {
            Матрица  новая = исключение  1 Матрица(5, 5);

            исключение 1.Случайный();
            исключение 1.Print();

            Консоль.WriteLine("Сумма:" + exemp1.Sum());

            Консоль.Строка записи();
            исключение 1.ГлавДиаг();

            Консоль.Строка записи();
            исключение 1.PassivDiag();

            Консоль.Ключ чтения();
        }
        /// <краткое изложение>
        /// Метод возвращает описание заданий лабораторной работы
        /// </резюме>
        /// <возвращает></возвращает>
        /// <returns>Описание лабы</returns>
        Строка описания   public()
        {
            " Задание 5"return;
        }
        /// <краткое изложение>
        /// Метод возвращает номер лабораторной работы
        /// </резюме>
        /// <returns>Номер лабы</returns>
        Идентификатор  int  public()
        {
            5  возврат;
        }
        /// <краткое изложение>
        /// Метод возвращает заголовок лабораторной работы
        /// </summary>
        /// <возвращает></возвращает>
        Имя  строки  public()
        {
            " Лабораторная №5. Тема: ООП"return;
        }
    }
}